arch/amd64-sys-regs.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2020-11-28 Sat 17:22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>AMD64(X86-64)系统寄存器介绍</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy(pqy7172@gmail.com)">
<link rel="stylesheet" href="../org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">AMD64(X86-64)系统寄存器介绍</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb85b247">1. 系统控制寄存器</a>
<ul>
<li><a href="#org9d66159">1.1. CR0寄存器</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
本文介绍AMD64架构下的系统寄存器, 这些寄存器可以说控制了整个AMD64机器的状态和功能. 当然这些介绍绝大部分同样也适合Intel系列的64位处理器.
</p>


<div id="outline-container-orgb85b247" class="outline-2">
<h2 id="orgb85b247"><span class="section-number-2">1</span> 系统控制寄存器</h2>
<div class="outline-text-2" id="text-1">
<p>
AMD64处理器包含常见的下列系统寄存器:
</p>
<ul class="org-ul">
<li>CR0: 提供处理器操作模式以及一些处理器特点的控制.</li>
<li>CR2: 由分页机制所使用. 当page-fault异常发生时, 就会被处理器填以page-fault的虚拟地址.</li>
<li>CR3: 由分页机制所使用. 这个寄存器存有最高级别的页表, 对指定的页表, 它也会包含一些对它的缓存控制.</li>
<li>CR4: 控制着操作模式各种特点.</li>
<li>CR8: AMD64架构特有的, 在64-bit模式下使用REX前缀来访问. CR8可以使得外部中断具有优先级, 也叫做TPR寄存器(Task-Priority Register).</li>
<li>RFLAGS: 该寄存器包含了处理器的状态和处理器控制域. 这些状态和控制域主要用来管理Virtual-8086模式, 硬件多任务以及中断.</li>
<li>EFER: 对于不由CR0-CR0管理的处理器特点, 这个寄存器会包含这些特点的状态和有无.</li>
</ul>

<p>
在legacy mode下, 所有的控制寄存器以及RFLAGS都是32-bit宽. EFER在所有模式下都是64-bit. 而AMD64架构下, 所有的32-bit控制寄存器都被扩展到了64-bit. 在64-bit模式下, 使用MOV CRn指令读写这些控制寄存器都会操作在所有64-bit范围上(如果指令有prefix的话会被忽略). 而在兼容和legacy模式下, 往控制寄存器里写只会把低32位填充有效数据, 高32位会被填0. 读这些寄存器就只会返回低32位的数据了.
</p>

<p>
在64-bit模式下, CR0和CR4的高32位是预留的并且只能写入0, 写入1的话会导致general-protection异常.
</p>
</div>

<div id="outline-container-org9d66159" class="outline-3">
<h3 id="org9d66159"><span class="section-number-3">1.1</span> CR0寄存器</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy(pqy7172@gmail.com)</p>
<p class="date">Created: 2020-11-28 Sat 17:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
